Tekla Open API Reference for Tekla Structures 2025
WindowBase.LocExtension Property
 The localization instance for the dialog. Each dialog has its own localization instance that has read the localization files needed for that dialog.
 Namespace: Tekla.Structures.Dialog
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public LocExtension LocExtension { get; }
Public ReadOnly Property LocExtension As LocExtension
	Get
Property Value
Type: LocExtension
See Also
Reference
WindowBase Class
Tekla.Structures.Dialog Namespace